Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob/facta/skuvlahistorja5/anny-s.htm.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 5.
nob: Artikkel i boka Samisk skolehistorie 5.

source: Sámi joatkkaskuvlla dearvvašvuođaoahppu
nob: Helsefagutdanninga ved samisk videregående skole

source: Svein Lund lea jearahallan
nob: Fortalt til Svein Lund

source: Anny Balto Somby (Govva: Svein Lund)
nob: Anny Balto Somby (Foto: Svein Lund)

source: Anny Balto Somby lea riegádan 1952:s ja bajásšaddan Kárášjogas.
nob: Anny Balto Somby er født i 1952 og oppvokst i Karasjok.

source: Son váccii joatkkaskuvlla Girkonjárggas ja Kárášjogas ja buohccedivššárskuvlla Hámmárfeasttas, mas gearggai 1982:s.
nob: Ho gikk gymnas i Kirkenes og Karasjok og sykepleieskole i Hammerfest, der ho gikk ut i 1982.

source: De son barggai guokte jagi buohccedivššárin Kolvereidas Trøndelagas, dan maŋŋá son lea bargan Kárášjogas.
nob: Så arbeida ho to år som sykepleier i Kolvereid i Trøndelag.

source: Doppe son lea bargan dearvvašvuođaguovddážis, ruovttubuohccedivššárin, ja maiddái bargan borasdávdasearvvis (Kreftforeningen).
nob: Deretter har ho vært i Karasjok, og arbeida ved helsesenteret, i hjemmesykepleien og for Kreftforeningen.

source: 1995 rájes son lea leamaš Sámi joatkkaskuvllas Kárášjogas, gos son lea oahpahan dearvvašvuođa- ja sosiálafága vuođđokurssa ja veahkkedivššár ja ambulánsa joatkkakurssa.
nob: Fra 1995 har Anny vært ved Samisk videregående skole i Karasjok, der ho har undervist grunnkurs i helse- og sosialfag og videregående kurs hjelpepleier og ambulanse fag.

source: Dan botta son lea gazzan pedagogihkkaoahpu ja máŋggakultuvrrat áddejumi.
nob: I løpet av den tida har ho også tatt utdanning i pedagogikk og flerkulturell forståelse.

source: Vuođđoskuvla ja joatkkaskuvla
nob: Grunnskole og gymnas

source: – Mun ledjen nu gohčoduvvon márkančivga.
nob: – Jeg var såkalt «márkančivga» (kirkestedsunge).

source: Ruovttus hálaimet eanaš sámegiela, muhto mis ledje ollu dárogielat ránnját.
nob: Hjemme snakka vi mest samisk, men vi hadde mange norskspråklige naboer.

source: Stohken dárogielat mánáiguin ja máhtten oalle bures dárogiela ovdal go álgen skuvlii.
nob: Jeg leika med de norskspråklige barna, og kunne ganske godt norsk før jeg beynte på skolen.

source: Dat mearkkaša ahte áddejin ja hállen, vaikko ii lean áibbas grammatihka mielde.
nob: Det vil si at jeg forsto og snakka, sjøl om det ikke var helt etter grammatikken.

source: Ledjen dálonmánáid klássas ja mis ledje dušše dárogielat oahpaheaddjit.
nob: Jeg var i klassen for fastboende elever, og vi hadde bare norskspråklige lærere.

source: Oidnen man váttis dilli lei mánáide geat eai máhttán go sámegiela.
nob: Jeg så hvor vanskelig situasjonen var for de barna som ikke kunne annet enn samisk.

source: Máŋggas čuldojuvvojedje, fertejedje vázzit guokte jagi vuosttaš luohkás.
nob: Mange dumpa, de måtte gå to år i første klasse.

source: Go gergen vuođđoskuvllas, de ii lean vel joatkkaskuvla Kárášjogas.
nob: Da jeg var ferdig med grunnskolen var det ennå ingen videregående skole i Karasjok.

source: Danin álgen Girkonjárgga gymnásii ja vázzen vuosttaš jagi doppe.
nob: Derfor begynte jeg på Kirkenes gymnas, og gikk første året der.

source: Go jagi maŋŋil álggahuvvui Kárášjoga gymnása, de fárrejin ruoktot ja vázzen guokte maŋimus jagi dáppe.
nob: Da Karasjok gymnas blei starta året etter, flytta jeg hjem og gikk de to siste åra der.

source: Girkonjárggas fuomášin man ollu negatiiva oainnut dan áigge ledje sámiid vuostá.
nob: I Kirkenes fikk jeg oppleve hvor mye negative holdninger det var mot samene i den tida.

source: Lei miessemánu 1. beaivvi ja mun ledjen čiŋadan nu fiidnát go sáhtten sámegávttiin ja vázzen «1. mai-toga».
nob: Det var 1. mai og jeg hadde pynta meg så fint jeg kunne med samekofte og gikk i 1. mai-toget.

source: Lei suorggahahtti vásihit ahte gehčče ártegit munnje ráiddus gávtti dihtii.
nob: Det var skremmende å oppleve at de så rart på meg i toget på grunn av kofta.

source: Girkonjárgga gymnásas in ožžon sámegiela fágan.
nob: På Kirkenes gymnas fikk jeg ikke samisk som fag.

source: Go ledjen juo geargan vuosttaš jagi sámegiela haga de in válljen sámegiela Kárášjogas ge.
nob: Da jeg hadde tatt første året uten samisk, så valgte jeg ikke samisk i Karasjok heller.

source: Máŋga jagi maŋŋil válden joatkkaskuvlaeksámena sámegielas, muhto in čále nu njuovžilit.
nob: Mange år seinere tok jeg videregående eksamen i samisk, men jeg skriver ikke så flytende.

source: Unnán sámi dearvvašvuođabargit
nob: Få samiske helsearbeidere

source: Finnmárkkus ledje ovdal sihke doaktárat ja buohccedivššárat dábálaččat Lulli-Norggas eret, ja máŋggas ledje dušše leamaš moadde jagi dahje vel oanibut davvin.
nob: I Finnmark var tidligere både leger og sykepleiere vanligvis fra Sør-Norge, og mange arbeida bare et par år eller enda kortere nordpå.

source: Máŋgga sámi guovllus eiseválddit eai váldán ovddasvástádusa lágidit dearvvašvuođabálvalusaid, muhto Sámemiššuvdna dat huksii ja hálddašii buohccestobuid ja eará dearvvašvuođaásahusaid.
nob: I mange samiske områder tok ikke myndighetene ansvar for helsetjenestene, men det var Samemisjonen som bygde og dreiv sykestuer og andre helseinstitusjoner.

source: Muittán ahte mu mánnávuođas ledje dušše rivgut geat barge buohccedivššárin Kárášjogas.
nob: – Jeg husker at i min barndom var det bare rivgut (ikke-samiske kvinner) som arbeida som sykepleiere i Karasjok.

source: Ja dat rivgut bovde min dohko Sámemiššuvnna buohccestohpui doallat nu gohččoduvvon «pikeforening» (nieiddaidsearvi) doppe.
nob: De ba oss dit til Samemisjonens sykestue for å holde såkalt «pikeforening» der.

source: Oaččuimet bolláid ja kakáo, mat dan áigge ledje albma herskkot.
nob: Vi fikk boller og kakao, som på den tida var virkelig godteri.

source: Ja de muittán ahte mis lei vuorbádeapmi miššuvnna várás.
nob: Jeg husker at vi hadde utlodning til inntekt for misjonen.

source: Sámemiššuvdna gáibidii ahte sin ásahusaid buohccedivššárat galge leat risttalažžan.
nob: Samemisjonen kreve at alle sjukepleiere ved deres institusjoner skulle være kristne.

source: Hámmárfestii álggahuvvui buohccedivššároahppu juo 1960:s, muhto vuosttaš logijagiid ledje unnán sámegielat studeanttat doppe.
nob: Sykepleierutdanninga i Hammerfest starta allerede i 1960, men de første tiåra var det svært få samisktalende studenter der.

source: Vuosttaš sámi oahppan dearvvašvuođabargit bohte Kárášjohkii 1970-logu álggus.
nob: De første samiske utdanna helsearbeiderne kom til Karasjok først på 1970-tallet.

source: Buohccedivššároahppu
nob: Sykepleierutdanninga

source: 1980:s manai Anny Hámmárfestii vázzit buohccedivššárskuvlla.
nob: I 1980 dro Anny til Hammerfest for å gå sykepleierskolen.

source: – Buohccedivššároahpus eat oahppan maidege sámi diliid birra.
nob: – På sykepleierutdanninga lærte vi ingenting om samiske forhold.

source: Eai ge oahpaheaddjit doppe diehtán nu ollu.
nob: Lærerne der visste heller ikke så mye.

source: Mus lei hárjehallanáigi Kárášjoga dearvvašvuođadivššára luhtte.
nob: Jeg hadde praksistid hos helsesøstera i Karasjok.

source: Dan maŋŋá čállen skuvllas sámi buhcciid dili birra, muhto oahpaheaddji ii sáhttán dárkkistit dan, go ieš ii diehtán maidege dan birra.
nob: Etter det skreiv jeg på skolen om situasjonen for samiske pasienter, men læreren kunne ikke kontrollere det, da hun sjøl ikke visste noe om dette.

source: Dan áigge ii lean álki leat sápmelažžan Hámmárfeasttas.
nob: I den tida var det ikke lett å være same i Hammerfest.

source: Álo lei diggon sámi áššiid birra.
nob: Alltid var det krangel om det samiske.

source: Ledje dábálaš oainnut ahte sámit ledje heajut go dážat.
nob: Det var et utbredt syn at samer var dårligere enn nordmenn.

source: Vásiheimmet dávjá ahte sihke mánát ja rávesolbmot lohke «helvetes fjellfinn».
nob: Vi opplevde ofte at både barn og voksne sa «helvetes fjellfinn».

source: Muhto dan áiggi lei juste álggahuvvon Sámiid searvi Hámmárfeasttas, ja mun serven dohko.
nob: Men på den tida var det nettopp starta sameforening i Hammerfest, og jeg blei med der.

source: Doppe ledje mielde sihke sámit Sis-Finnmárkkus ja sámit Áltávuonas ja Sállannuori sulluin.
nob: Der var det både samer fra Indre Finnmark og fra Altafjorden og øyene i Sørøysundet.

source: Go gergen skuvllas háliidivččen ruoktot Kárášjohkii.
nob: Da jeg blei ferdig på skolen, ønska jeg meg hjem til Karasjok.

source: Ieš livččen ožžon barggu, muhto mu isit ii ožžon, danin manaime álggos Trøndelagii, gos goappašat oaččuime barggu.
nob: Sjøl kunne jeg fått arbeid, men mannen min fikk ikke, derfor dro vi først til Trøndelag, der vi fikk arbeid begge to.

source: Easka go Kárášjohkii álggahuvvui spesialistadoavttirbálvalus de oaččui isit maid barggu, ja fárriime Kárášjohkii, ja dáppe letne orron dan rájes.
nob: Først da det blei starta opp spesialistlegetjeneste i Karasjok fikk mannen min også arbeid og da flytta vi hjem og her har vi vært siden.

source: Go bargagohten Kárášjogas de lei juo eará dilli.
nob: Nå hadde myndighetene tatt ansvar for helsetjenesten.

source: Dál ledje eiseválddit váldán ovdasvástádusa dearvvašvuođabálvalusas.
nob: Sykestua var overtatt av fylket, og helsesøster og gamlehjem var kommunalt ansvar.

source: Dalle ledje juo ollu sámit geat barge doppe.
nob: Da var det allerede mange samer som arbeida der.

source: Ieš bargen guhká buohcceossodagas ja ruovttubuohccedikšumis, buohccedivššárin ja ossodatjođiheaddjin.
nob: Sjøl arbeida jeg lenge som avdelingsleder og sykepleier på sykeavdelingen og i hjemmesykepleien.

source: Formálalaš ja eahpeformálalaš dearvvašvuođabargu
nob: Formelt og uformelt helsearbeid

source: – Vaikko ovdal ledje unnán sámit geain lei formálalaš dearvvašvuođaoahppu, de ledje dattetge sámit geat máhtte veahkehit buhcciid.
nob: – Sjøl om det tidligere var få samer som hadde formell helseutdanning, så var det likevel samer som kunne hjelpe syke.

source: Kárášjogas ledje muhtin olbmot geat máhtte buoridit.
nob: I Karasjok var det flere som kunne helbrede.

source: Sáhtte vara bissehit, spárttuid váldit eret ja dálkkodit eksema.
nob: De kunne stanse blod og ta bort vorter og lege eksem.

source: Ledje muhtin čiegusvuođat, nu ahte in dieđe juste mo sii dahke, muhto geavahedje goit gunaid spárttuid vuostá ja bihka eksema vuostá.
nob: De hadde noen hemmeligheter, slik at jeg vet ikke akkurat hva de gjorde, men de brukte i alle fall aske mot vorter og tjære mot eksem.

source: Bealljebákčasa vuostá geavahedje sávzzaullu ja beatnatguolggaid.
nob: Mot øreverk brukte de saueull og hundehår.

source: Čalbmevearkka vuostá galggai bassat guččain ja ájačáziin.
nob: Mot øyebetennelse skulle man vaske med urin og kildevann.

source: Gáhčči lei buorre háviid vuostá ja sieđgaostu nuorvvu vuostá.
nob: Kvae var bra mot sår og seljebark mot forkjølelse.

source: Olbmot sáhtte mannat guhkás vai beassat buoremus buorideddjiid lusa.
nob: Folk kunne dra langt for å komme til de beste helbrederne.

source: Muittán ahte mu nuorravuođas ledje muhtin beakkán buorideaddjit Deanus, ja olbmot sáhtte mannat Kárášjogas gitta Deanodahkii ja Juovlavutnii.
nob: Jeg husker at i min ungdom var det noen berømte helbredere i Tana, og folk kunne dra fra Karasjok helt til Vestertana og Austertana.

source: Dearvvašvuođabargiide lea dehálaš diehtit ja váldit vuhtii ahte sámi guovlluin lea ain ealli eahpeformálalaš dearvvašvuođaárbevierut.
nob: For helsearbeidere er det viktig å vite og ta hensyn til at i samiske områder er det fortsatt en levende uformell helsetradisjon.

source: Danin lea vejolaš ahte buohccit maiddái ohcet veahki guvhlláriin dahje buorideddjiin dearvvašvuođaásahusaid olggobealde.
nob: Derfor er det mulig at pasienter også søker hjelp av helbredere utenfor helseinstitusjonene.

source: Ovdal dat lei dakkár čiegus ášši maid buohccit eai duostan muitalit doaktárii eai ge buohccedivššárii.
nob: Før var dette ei hemmelig sak, som pasientene ikke torde å fortelle til legen eller sykepleieren.

source: Muittán ahte 1980-logus bovdii Sámi doaktáriid searvi buorideaddji Valle Fanasgiettis sin čoahkkimii ja dalle mii hállagođiimet jitnosit dan birra.
nob: Jeg husker at på 1980-tallet innbød Samisk legeforening helbrederen Valle fra Båteng i Tana til sitt møte.

source: Dan maŋŋá duste maiddái eará dearvvašvuođabargit hállat dan birra.
nob: Etter det torde også andre helsearbeidere å snakke høyt om dette.

source: Oahpaheaddjin
nob: Faglærer

source: 1995:s jerre joatkkaskuvllas sáhtán go mun álgit dohko dearvvašvuođafágaid oahpaheaddjin.
nob: – I 1995 spurte de fra videregående skole om jeg kunne begynne der som lærer i helsefag.

source: Gažaldat bođii hui vuohkkasit munnje, go ledjen ožžon čielgeváttuid máŋga jagi buohccedivššárbarggu maŋŋá, ja livččii váttis munnje joatkit dakkár barggus.
nob: Spørsmålet kom svært høvelig for meg, da jeg hadde fått ryggplager etter mange års arbeid som sykepleier, og det ville være vanskelig for meg å fortsette med slikt arbeid.

source: Sámi joatkkaskuvllas ledje leamaš dearvvašvuođa- ja sosiálafágat juo 1982 rájes.
nob: Samisk videregående skole hadde hatt helse og sosialfag siden 1982.

source: Álgojagit dat lei oassin 2-jagáš «kombinert grunnkurs», mas 2 jagis oahppit ožžo dearvvašvuođa- ja sosiálafága vuođđokurssa ja dábálašfága vuođđokurssa.
nob: De første åra var det som del av «kombinert grunnkurs», der elevene i løpet av to år fikk helse- og sosialfag grunnkurs og allmennfag grunnkurs.

source: Dat ii bistán guhká, farga šattai buiga dearvvašvuođa- ja sosiálafága vuođđokursa.
nob: Det varte ikke lenge, snart blei det i stedet reint grunnkurs helse- og sosialfag.

source: Maŋŋil bođii veahkkedivššár JK 1 ja fas veahkkedivššár JK 2. Oahpaheaddjit geat leat leamaš dán suorggis leat sihke sámit ja dážat, muhto dat geat bohte olggobealde ledje ovdal bargan dearvvašvuođabálvalusas sámi guovlluin ja ledje integrerejuvvon sosiálalaččat ja dađistaga maiddái gielalaččat.
nob: Seinere kom hjelpepleier VK 1 og så VK 2. Lærerne som har vært på den linja har vært både samiske og norske, men de som kom utenfra hadde tidligere arbeida ved helsetjenesten i samiske områder, og var integrerte sosialt og etter hvert også språklig. Nå har vi fire lærere på helseavdelinga.

source: Dál mii leat njeallje oahpaheaddji dearvvašvuođaossodagas.
nob: To kan godt samisk og kan bruke språket i alle sammenhenger.

source: Guovttis fas máhttiba oalle bures, muhto eaba geavat giela oahpahusas.
nob: To kan språket ganske bra, men bruker det ikke i undervisninga.

source: Dearvvašvuođa- ja sosiálafágaoahppit Laila Labba ja Per Egil Kroken ovttas oahpaheddjiin Mary Helene Stueng.
nob: Helse- og sosialfagelevene Laila Labba og Per Egil Kroken sammen med lærer Mary Helene Stueng.

source: (Govva: Svein Lund)
nob: (Foto: Svein Lund)

source: Sámi ja dáža oahppit
nob: Samiske og norske elever

source: – Álggu rájes lea leamaš sihke sámegielat ja dárogielat oahppit, ollu sámegielat oahppit, ollu dárogielat sámit, maiddái rivgooahppit, muhtimat Lulli-Norggas eret.
nob: – Fra starten har det vært både samisk- og norskspråklige elever. Det har vært mange samiskspråklige, mange norskspråklige samer, men også noen norske, noen av dem fra Sør-Norge.

source: Muhtin jagiid mis leat maiddái leamaš sámi oahppit Suoma bealde, geat eai leat máhttán nu ollu dárogiela.
nob: Noen år har vi også hatt samiske elever fra finsk side, som ikke har kunnet så mye norsk.

source: Nu ahte dovddan ahte duođaid dárbbašan goappašiid giela go barggan oahpaheaddjin.
nob: Slik at jeg kjenner at jeg virkelig trenger begge språka når jeg arbeider som lærer.

source: Dávjá lean ferten geavahit guokte giela bálddalagaid, ja ferten mieđihit ahte dat gáibida ollu návccaid.
nob: Ofte har jeg vært nødt å bruke begge språk samtidig, og jeg må innrømme at det er svært krevende.

source: Go oahpaheaddji ieš ii leat oahppan fága sámegillii, de lea váttis gávdnat sániid sámegillii.
nob: Når læreren sjøl ikke har lært faget på samisk, så er det vanskelig å finne ord på samisk.

source: Maid dearvvašvuođabargi berre diehtit
nob: Hva helsearbeidere bør vite

source: – Dearvvašvuođaoahpahusas mii leat deattuhan maid dearvvašvuođabargit geat galget bargat sámi buhcciiguin berrejit diehtit vai gulahallat bures.
nob: – I helseutdanninga har vi lagt vekt på hva helsearbeidere som skal arbeide med samiske pasienter bør vite for å kommunisere godt.

source: Ovddamearkka dihte mo diehtit mieđiha go buohcci vai lea go son duođaid nuppi oaivilis: Dáža birrasis, ja oahppogirjji mielde, de dulkojuvvo dábálaččat nu ahte jus buohcci lea jávohaga, de mieđiha.
nob: For eksempel hvordan man skal vite om pasienten er enig eller kanskje uenig: I norsk miljø, og etter læreboka, tolkes det gjerne slik at den som tier samtykker.

source: Muhto nu ii leat sámi árbevierus, jus lea jávohaga, de dávjá mearkkaša ahte ii mieđit.
nob: Men slik er det ikke i samisk tradisjon, dersom man tier, betyr det ofte at man ikke er enig.

source: Sáhttá maiddái leat váttis dearvvašvuođabargiide dulkot vástádusaid nugo «a-a» ja «m-m».
nob: Det kan også være vanskelig for helsearbeidere å tolke svar som «a-a» og «m-m».

source: Borramuš lea hui dehálaš dearvvašvuhtii ja sámi buhcciide lea dehálaš ahte sii ožžot borramuša maid dovdet ja liikojit.
nob: Mat er svært viktig for helsa og for samiske pasienter er det viktig at de får mat som de kjenner og liker.

source: Dat buorida loaktima ja dainna maiddái dearvvašvuođa.
nob: Det bedrer trivselen og dermed også helsa.

source: Ovdal lei nu ahte boares olbmot eai lean hárjánan borrat šattuid, dál leat measta buohkat hárjánan dasa.
nob: Før var det slik at gamle folk ikke var vant til å spise grønnsaker, nå er nesten alle vant til det.

source: Dearvvašvuođaguovddážis sii leat dál ollu čeahpit go ovdal beroštit das maid buohccit háliidit borrat.
nob: På helsesenteret er de nå mye flinkere å ta hensyn til hva pasientene ønsker å spise.

source: Oahppoplánat
nob: Læreplaner

source: Dearvvašvuođaoahppu čuovvu našunála oahppoplánaid, mat leat seamma miehtá Norgga.
nob: Helseutdanninga følger nasjonale læreplaner, som har samme innhold over hele Norge.

source: Ja go našunála oahppoplánat rievdaduvvojit, de fertejit sámi skuvllat čuovvulit.
nob: Og når de nasjonale læreplanene blir endra, må samiske skoler følge etter.

source: 1999/2000 iskkai Sámi Instituhtta mo Ođastus 94 lei váikkuhan sámi joatkkaskuvllaide, ja Anny lei daid gaskkas geat muitaledje dutkiide mo dilli lei dearvvašvuođa- ja sosiálafágain.
nob: I 1999/2000 undersøkte Nordisk Samisk Institutt hvordan Reform 94 hadde påvirka samisk videregående opplæring, og Anny var en av dem som fortalte forskerne hvordan forholda var i helse- og sosialfag.

source: Oahpaheaddjit muitaledje ahte oahppoplánat eai namuhan sámiid erenoamážit, muhto baicce deattuhedje «norske tradisjoner».
nob: Lærerne fortalte at læreplanene ikke nevnte samene spesielt, men heller vektla «norske tradisjoner».

source: Nuppi dáfus deattuhuvvui kultuvra, ja Sámi joatkkaskuvllas oahpaheaddjit válljejedje dulkot dan buoremus lági mielde nu ahte sámi guovlluin galgá sámi kultuvra leat vuođđun.
nob: På den andre sida la de vekt på kultur, og lærerne ved Samisk videregående skole valgte å tolke det på best mulig måte slik at i samiske områder skal samisk kultur være grunnlaget.

source: Muhto vaikko oahppoplána lei rabas nu ahte sámi joatkkaskuvllas sáhtte dulkot dan iežaset vuogi mielde, ii lean oahpaheddjiid mielas dohkálaš ahte eai namuhan sámiid ja sámi buhcciid dárbbuid oppanassiige.
nob: Men sjøl om læreplanene var åpne slik at de samiske videregående skolene kunne tolke dem på sin egen måte, var det etter lærernes mening ikke holdbart at samer og samiske pasienters behov overhodet ikke var nevnt.

source: Go miehtá riikka sáhttet dearvvašvuođabargit deaivvadit sámi buhcciiguin, ja dalle dárbbašit diehtit maid berrejit dahkat váldit sin dárbbuid vuhtii.
nob: For over hele landet kan helsepasienter møte samiske pasienter, og da trenger de å vite hva de bør gjøre for å ta hensyn til deres behov.

source: Danin namuhedje oahpaheaddjit SI-raportta mielde áššiid mat galggašedje leat mielde oahppoplánas: «Ovttasbargovuogit ja gulahallan, giela mearkkašupmi, sámi historjá, dulkka geavaheapmi, sámi biebmoárbevierut, árbevirolaš sámi dikšun- ja fuolahusvuogit, mo sámit celket dovdduid, sámi árvvut, kodat ja kulturerohusat.»
nob: Derfor nevnte lærerne i NSI-rapporten noen saker som burde være med i læreplanen: «Samhandlingsmåter og kommunikasjon, betydninga av språket, samisk historie, bruk av tolk, samiske mattradisjoner, tradisjonelle samiske måter å tenke pleie og omsorg på, korleis samar uttrykker kjensler, samiske verdiar, kodar og kulturforskjellar.»

source: Oahpaheddjiid mielas dat berre leat mielde našunála oahppoplánas, jus dat šaddá mielde, de ii lean sin mielas dárbu ráhkadit sierra sámi oahppoplána dearvvašvuođa- ja sosiálafágain.
nob: Etter lærernes mening burde dette være med i den nasjonale læreplanen. Om det blei med, så ville det etter deres mening ikke være behov for en egen samisk læreplan i helse- og sosialfag.

source: Nu lei dilli go sii muitaledje 1999:s.
nob: Anny forteller hva som skjedde siden:

source: – Ozaimet ja oaččuimet ruđa skuvlla FoU-bušeahtas heivehit oahppoplána sámi diliide.
nob: – Vi søkte og fikk penger fra skolens budsjett for utviklingsarbeid, så vi kunne tilpasse læreplanen til samiske forhold.

source: Bargagođiimet dainna, muhto eat joavdan nu guhkás dainna ovdal go heaittihuvvui veahkkedivššároahppu, ja de bođii fas ođđa oahppoplána, «Máhttolokten».
nob: Vi begynte å arbeide med det, men vi kom ikke så langt før hjelpepleierutdanninga blei lagt ned. Og så kom det igjen en ny læreplan, «Kunnskapsløftet».

source: Ja ferten dadjat ahte skuvlaeiseválddit eai leat váldán sámi oahpaheddjiid oainnu vuhtii.
nob: Og jeg må si at i denne saka har ikke myndighetene tatt hensyn til samiske læreres syn.

source: Ii ge Máhttoloktema mielde leat mihkkege sámiid birra našunála oahppoplánas, eat ge ožžon sierra sámi oahppoplána.
nob: Heller ikke i den nye planen er det noe om samene, og vi har heller ikke fått egen samisk læreplan.

source: Ja go ii leat oahppoplánas, de eat ge sáhte čujuhit dasa ja gáibidit ahte dat boahtá mielde oahppogirjjiide.
nob: Og når det ikke er i læreplanen, kan vi ikke vise til denne og kreve at det kommer med i lærebøkene.

source: Oahppogirjjit
nob: Lærebøker

source: Oahppogirjjiid birra muitaluvvui SI- raporttas ahte eai lean sámegiel girjjit, eai ge lean sierra girjjit sámi fáttáid birra.
nob: Om lærebøker blei det i NSI- rapporten fortalt at det ikke var bøker på samisk, og heller ikke bøker på norsk om samiske emner.

source: Dábálaš fágaoahppogirjjiin gal ledje moadde linjá sámiid birra, muhto dávjá nu boastut ahte lei vearrát go ii mihkkege.
nob: I de vanlige fagbøkene var det noen få linjer om samene, men ofte så galt at det var verre enn ingenting.

source: Oahpaheaddjit ledje danin ieža čohkken bearpma mas ledje dakkár dieđut maid dárbbašedje oahpahusas.
nob: Lærerne hadde derfor samla en perm med slik informasjon som de trengte i undervisninga.

source: Sin mielas ii lean dárbu ráhkadit sierra sámi oahppogirjjiid, muhto háliidedje fáddágirjjiid sihke sámegillii ja dárogillii fáttáid birra: Sámi borramuš, anatomiija, sámi kultuvra ja dearvvašvuođadoaibma, dulkon ja giellavuoigatvuođat, sámi álbmotdálkasat.
nob: Etter deres mening var det ikke behov for å lage helt egne samiske lærebøker, men de ønska emnehefter både på samisk og norsk om disse emnene: samisk mat, anatomi, samisk kultur og helsearbeid, tolking og språkrettigheter, samisk folkemedisin.
